### Result

```
# module.api_gateway.aws_api_gateway_authorizer.authorizer["authorizer_lambda"] will be updated in-place
~ resource "aws_api_gateway_authorizer" "authorizer" {
    ~ authorizer_uri                   = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:***:function:authorizer_lambda/invocations" -> "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:***:function:authorizer_lambda:1/invocations"
      id                               = "8xggip"
      name                             = "api-authorizer-authorizer_lambda"
      # (7 unchanged attributes hidden)
  }

# module.api_gateway.aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
    ~ created_date      = "2023-10-24T16:46:23Z" -> (known after apply)
    ~ execution_arn     = "arn:aws:execute-api:us-east-1:***:x85tnyhz7c/" -> (known after apply)
    ~ id                = "8f3gld" -> (known after apply)
    ~ invoke_url        = "https://x85tnyhz7c.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
    ~ stage_description = "cb03e720883c3cae5cdf973d132f3824cd4d192a" -> "a79b89403b3fc10f842c67cd9c9d8b40e6cda3d4" # forces replacement
    ~ triggers          = { # forces replacement
        ~ "redeployment" = "cb03e720883c3cae5cdf973d132f3824cd4d192a" -> "a79b89403b3fc10f842c67cd9c9d8b40e6cda3d4"
      }
      # (1 unchanged attribute hidden)
  }

# module.api_gateway.aws_api_gateway_integration.rest_api_route_integration["health"] will be updated in-place
~ resource "aws_api_gateway_integration" "rest_api_route_integration" {
      id                      = "agi-x85tnyhz7c-4vettc-GET"
    ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:***:function:health_lambda/invocations" -> "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:***:function:health_lambda:1/invocations"
      # (12 unchanged attributes hidden)
  }

# module.api_gateway.aws_api_gateway_integration.rest_api_route_integration["{proxy+}"] will be updated in-place
~ resource "aws_api_gateway_integration" "rest_api_route_integration" {
      id                      = "agi-x85tnyhz7c-pemoi9-ANY"
    ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:***:function:services_enrollment_entrypoint_lambda/invocations" -> "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:***:function:services_enrollment_entrypoint_lambda:1/invocations"
      # (12 unchanged attributes hidden)
  }

# module.api_gateway.aws_api_gateway_stage.stage will be updated in-place
~ resource "aws_api_gateway_stage" "stage" {
    ~ deployment_id         = "8f3gld" -> (known after apply)
      id                    = "ags-x85tnyhz7c-v1"
      tags                  = {}
      # (9 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }
```